{
    "name": "Johor",
    "administrative_division": "State of Malaysia",
    "full_name": "Negeri dan Jajahan Takluk Johor Darul Ta'zim",
    "jawi_name": "جوهر",
    "chinese_name_simplified": "柔佛",
    "chinese_name_traditional": "柔佛",
    "tamil_name": "ஜொகூர்",
    "flag_url": "https://en.wikipedia.org/wiki/Johor#/media/File:Flag_of_Johor.svg",
    "crest_url": "https://en.wikipedia.org/wiki/Johor#/media/File:Coat_of_arms_of_Johor.svg",
    "motto": "Kepada Allah Berserah",
    "capital": "Johor Bahru",
    "royal_capital": "Muar",
    "government_type": [
        "Parliamentary",
        "constitutional monarchy"
    ],
    "government_sultan": "Ibrahim Ismail",
    "government_menteri_besar": "Hasni Mohammad",
    "area": "19,166km2",
    "highest_elevation": "1,276 m (4,186 ft)",
    "population_total": 3700000,
    "population_density": "174/km2",
    "demonyms": [
        "Johoreab",
        "Johorian"
    ],
    "state_index": {
        "human_development_index": 0.818,
        "total_fertility_rate": 2.1,
        "gross_domestic_product": "RM116,682 million"
    },
    "time_zone": "UTC+8",
    "postal_code": [
        "79xxx to 86xxx",
        "73400"
    ],
    "calling_code": [
        "07",
        "06"
    ],
    "iso_3166_code": [
        "MY-01",
        "21–24"
    ],
    "vehicle_registration": "J",
    "administrative_districts": [
        "Batu Pahat",
        "Johor Bahru",
        "Kluang",
        "Kota Tinggi",
        "Kulai",
        "Mersing",
        "Muar",
        "Pontian",
        "Segamat",
        "Tangkak"
    ],
    "website": [
        "https://www.johor.gov.my/"
    ],
    "unemployment_rate": [
        {
            "year": 2020,
            "unemployed_percent": 3.5
        }
    ],
    "total_active_vehicles": 2157400,
    "total_inactive_vehicles": 1640497,
    "description": "Johor (/dʒəˈhɔːr/; Malay pronunciation: [d͡ʒoho(r)]), also spelled as Johore, is a state of Malaysia in the south of the Malay Peninsula. Johor has land borders with the Malaysian states of Pahang to the north and Malacca and Negeri Sembilan to the northwest. Johor shares maritime borders with Singapore to the south and Indonesia to both the west and east. Johor Bahru is the capital city and the economic centre of the state, Kota Iskandar is the seat of the state government, and Muar serves as the royal town of the state. The old state capital is Johor Lama. As of 2017, the state's population is 3,700,000. Johor has highly diverse tropical rainforests and an equatorial climate. The state's mountain ranges form part of the Titiwangsa Range, which is part of the larger Tenasserim Range connected to Thailand and Myanmar, with Mount Ophir being the highest point in Johor. An early Johor-centred kingdom had early contact with Funan based on the exchange of gifts. After the demise of the kingdom, much of the Malay coast fell under the jurisdiction of Siam and later Majapahit. Several decades later, with the emergence of the Malaccan Empire, Islam spread throughout the Malay Archipelago. After the fall of the empire to the Portuguese, remnants of the Malaccan royal family moved to a river in the southern Malay Peninsula known to the locals as the Johor River and establishing a new sultanate, which became the Johor Empire. Their attempts to retake Malacca resulted in a three-way war between Johor, the Portuguese, and Aceh, another rising sultanate in northern Sumatra. With the arrival of the Dutch East India Company (VOC), Johor ended Portuguese rule and restored its own rule to many of its former dependencies in Sumatra, although Malacca continued to be held by foreign powers. Through an internal dispute within the Johor sultanate and the presence of the East India Company (EIC) in the northern Malay Peninsula, Dutch trade changed from being involved in local disputes to rapidly conquering much of Sumatra and signing the Anglo-Dutch Treaty of 1824 with the British to prevent further conflicts with the latter.Under the treaty, the Malay Archipelago was divided under two spheres of influence; the British gained the entire Malay Peninsula while the Dutch surrendered their Malaccan possession in exchange for British Bencoolen and the rest of Sumatra and other territories such as Java located farther south. Under British rule, priority was given towards education and development and the Johor royal administration itself was reformed under a British-style monarchy. The three-year occupation by the Japanese in World War II halted modernisation. After the war, Johor became part of the temporary Malayan Union before being absorbed into the Federation of Malaya under certain terms and gaining full independence through the federation, and subsequently Malaysia on 16 September 1963.Johor has high diversity in ethnicity, culture and language. The state is known for its traditional dance of zapin and Kuda kepang. The head of state is the Sultan of Johor, while the head of government is the Menteri Besar. The government system is closely modelled on the Westminster parliamentary system, with the state administration divided into administrative districts. Islam is the state religion per the 1895 Constitution of Johor, but other religions can be freely practised. Both Malay and English have been accepted as official languages for the state since 1914. The economy is mainly based on services and manufacturing"
}