{
    "name": "Kuala Lumpur",
    "administrative_division": "Federal Territory of Malaysia",
    "full_name": "Wilayah Persekutuan Kuala Lumpur",
    "jawi_name": "ولايه ڤرسكوتوان کوالا لومڤور",
    "chinese_name_simplified": "吉隆坡联邦直辖区",
    "chinese_name_traditional": "吉隆坡聯邦直轄區",
    "tamil_name": "கோலாலம்பூர்",
    "motto": "Bersedia Menyumbang Bandaraya Cemerlang",
    "capital": "Kuala Lumpur",
    "royal_capital": "Kuala Lumpur",
    "area": "243km2",
    "population": 1790000,
    "administrative_districts": [
        "Bukit Bintang",
        "Titiwangsa",
        "Setiawangsa",
        "Wangsa Maju",
        "Batu",
        "Kepong",
        "Segambut",
        "Lembah Pantai",
        "Seputeh",
        "Bandar Tun Razak",
        "Cheras"
    ],
    "unemployment_rate": [
        {
            "year": 2020,
            "unemployed_percent": 4.0
        }
    ],
    "total_active_vehicles": 4668408,
    "total_inactive_vehicles": 1907213,
    "description": "Kuala Lumpur (Malaysian pronunciation: [ˈkualə, -a ˈlumpo(r), -ʊ(r)]), officially the Federal Territory of Kuala Lumpur (Malay: Wilayah Persekutuan Kuala Lumpur) and colloquially referred to as KL, is a federal territory and the capital city of Malaysia. It is the largest city in Malaysia, covering an area of 243 km2 (94 sq mi) with an estimated population of 1.73 million as of 2016. Greater Kuala Lumpur, also known as the Klang Valley, is an urban agglomeration of 7.564 million people as of 2018. It is among the fastest growing metropolitan regions in Southeast Asia, in both population and economic development. Kuala Lumpur is the cultural, financial and economic centre of Malaysia. It is also home to the Parliament of Malaysia and the official residence of the Yang di-Pertuan Agong, the Istana Negara. Kuala Lumpur first developed around 1857 as a town serving the tin mines of the region and served as the capital of Selangor from 1880 until 1978. Kuala Lumpur was the founding capital of the Federation of Malaya and its successor Malaysia and the city remained the seat of the executive and judicial branches of the Malaysian federal government until these were relocated to Putrajaya in early 1999. However, some sections of the political bodies still remain in Kuala Lumpur. Kuala Lumpur is one of the three federal territories of Malaysia, enclaved within the state of Selangor, on the central west coast of Peninsular Malaysia. Since the 1990s, the city has played host to many international sporting, political and cultural events including the 1998 Commonwealth Games and the 2017 Southeast Asian Games. Kuala Lumpur has undergone rapid development in recent decades and is home to the tallest twin buildings in the world, the Petronas Towers, which have since become an iconic symbol of Malaysian development. Kuala Lumpur has a comprehensive road system supported by an extensive range of public transport networks, such as mass rapid transit (MRT), light rapid transit (LRT), monorail, commuter rail, public buses, hop on & hop off buses (free of charge) and airport rail links. Kuala Lumpur is one of the leading cities in the world for tourism and shopping, being the 6th most-visited city in the world in 2019. The city houses three of the world's 10 largest shopping malls. Kuala Lumpur is ranked No. 70 in the world & No. 2 in Southeast Asia for Economist Intelligence Unit's Global Liveability Ranking and No. 9 in ASPAC & No. 2 in Southeast Asia for KPMG's Leading Technology Innovation Hub 2021. Kuala Lumpur was named as World Book Capital 2020 by UNESCO."
}