{
    "name": "Penang",
    "administrative_division": "State of Malaysia",
    "full_name": "Penang (Pulau Pinang)",
    "jawi_name": "ڤولاو ڤينڠ",
    "chinese_name_simplified": "槟城",
    "chinese_name_traditional": "檳城",
    "tamil_name": "பினாங்கு",
    "flag_url": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Flag_of_Penang_%28Malaysia%29.svg",
    "motto": "Bersatu dan Setia",
    "capital": "George Town",
    "royal_capital": "",
    "area": "1,048 km2",
    "population":  1783000,
    "administrative_districts": [
        "Alma, Bukit Mertajam",
        "Central Seberang Perai",
        "North Seberang Perai",
        "Northeast Penang Island",
        "South Seberan Perai",
        "Southwest Penang Island"
    ],
    "unemployment_rate": [
        {
            "year": 2020,
            "unemployed_percent": 3.5
        }
    ],
    "total_active_vehicles": 1729209,
    "total_inactive_vehicles": 1056738,
    "description": "Penang is a Malaysian state located on the northwest coast of Peninsular Malaysia, by the Malacca Strait. It has two parts: Penang Island, where the capital city, George Town, is located, and Seberang Perai on the Malay Peninsula. They are connected by Malaysia's two longest road bridges, the Penang Bridge and the Sultan Abdul Halim Muadzam Shah Bridge; the latter is also, as of May 2019, the longest oversea bridge in Southeast Asia. The second smallest Malaysian state by land mass, Penang is bordered by Kedah to the north and the east, and Perak to the south. It is one of the country's most urbanised states. Its heterogeneous population is highly diverse in ethnicity, culture, language and religion. Known as the Silicon Valley of the East for its industries, Penang is one of Malaysia's most vital economic powerhouses. The state has a relatively well-educated population, with a youth literacy rate of 99.5% as of 2014. Penang is also home to the smallest national park in the world - the Penang National Park. Other notable natural attractions nearby include the Tropical Spice Garden and the Entopia Butterfly Farm, the latter of which was Malaysia's first butterfly sanctuary. In Seberang Perai, the Penang Bird Park, established in 1988 in Seberang Jaya, was the first aviary in Malaysia. The state also has rich performing arts culture , and George Town is the birthplace of a unique form of the Chingay procession. Bangsawan, which was also developed in Penang, is a type of Malay theatre that incorporates Indian, Western, Islamic, Chinese and Indonesian influences."
}